{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hi", "Hello", "Hey", "Howdy"],
      "responses": ["Hi there! How can I help you?", "Hello! What can I do for you?", "Hey! How can I assist you today?"]
    },
    {
      "tag": "headache",
      "patterns": ["I have a headache", "My head hurts", "Headache"],
      "responses": ["I'm sorry to hear that. Have you taken any pain relievers?", "Headaches can be tough. Have you tried resting or taking some water?"]
    },
    {
      "tag": "stomachache",
      "patterns": ["I have a stomachache", "My stomach hurts", "Stomachache"],
      "responses": ["I'm sorry to hear that. Have you had any unusual foods lately?", "Stomachaches can be uncomfortable. Have you tried drinking some herbal tea?"]
    },
    {
      "tag": "cough",
      "patterns": ["I have a cough", "I'm coughing", "Cough"],
      "responses": ["Coughing can be bothersome. Have you tried honey and lemon?", "Cough drops might help. Have you tried any?"]
    },
    {
      "tag": "fever",
      "patterns": ["I have a fever", "I'm running a temperature", "Fever"],
      "responses": ["A fever could mean your body is fighting an infection. Have you taken any medication?", "Try keeping yourself hydrated and resting if you have a fever."]
    },
    {
      "tag": "skin_rash",
      "patterns": ["I have a skin rash", "I'm experiencing a rash", "Skin rash"],
      "responses": ["Rashes can be caused by various factors. Have you applied any ointments or creams?", "Keep the affected area clean and dry. If it persists, consider consulting a dermatologist."]
    },
    {
      "tag": "thank_you",
      "patterns": ["Thank you", "Thanks", "Appreciate it"],
      "responses": ["You're welcome!", "Glad I could assist you!"]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "Goodbye", "See you later"],
      "responses": ["Goodbye! Take care.", "See you later! Have a great day."]
    },
    {
      "tag": "help",
      "patterns": ["Help", "I need help", "Can you help me"],
      "responses": ["Of course! Feel free to ask me anything related to health or wellness."]
    },
    {
      "tag": "thanks_feedback",
      "patterns": ["Thank you for your help", "Thanks for the assistance", "Appreciate the support"],
      "responses": ["You're welcome! If you have any more questions, don't hesitate to ask."]
    },
    {
      "tag": "emergency",
      "patterns": ["Emergency", "I need emergency help", "Urgent"],
      "responses": ["If you're experiencing a medical emergency, please call emergency services immediately."]
    },
    {
      "tag": "medication_query",
      "patterns": ["What medication should I take for a cold?", "Any recommendations for flu medication?", "What can I take for allergies?"],
      "responses": ["For colds, consider over-the-counter cold remedies like decongestants or pain relievers. Always consult a healthcare professional for personalized advice."]
    },
    {
      "tag": "diet_advice",
      "patterns": ["Can you recommend a healthy diet plan?", "What should I eat to lose weight?", "Any tips for a balanced diet?"],
      "responses": ["A balanced diet includes a variety of fruits, vegetables, lean proteins, and whole grains. Consider consulting a nutritionist for personalized diet advice."]
    },
    {
      "tag": "exercise_recommendation",
      "patterns": ["What exercises are good for improving flexibility?", "Can you suggest workouts for strength training?", "How often should I exercise?"],
      "responses": ["Yoga and stretching exercises can improve flexibility. Strength training exercises like weightlifting and bodyweight exercises can help build muscle. Aim for at least 150 minutes of moderate-intensity aerobic activity per week."]
    },
    {
      "tag": "ulcer",
      "patterns": ["I have an ulcer", "Ulcer", "My stomach ulcer is bothering me"],
      "responses": ["I'm sorry to hear that. It's important to avoid spicy and acidic foods if you have an ulcer. Have you consulted a healthcare professional for treatment options?"]
    }
  ]
}
